/* 이벤트씬 */
export const openingTexts = [
  "< 개학 하루 전 >",
  "방학 동안 한 거라곤",
  "게임밖에 없는데 개학이라니...",
  "거짓말이다... 거짓말이 분명해...",
  "늦었지만 뭐라도 준비를...",
  "뭐든 하다 자자!!",
  `\n[ 1. 계속 ] [ 2. 로비로 ]`,
];

export const moodZeroTexts = [
  "< 기분, 최저... >",
  "겨우 집에 와서 쉬나했더니만",
  "저녁 내내 지루한 책이나 보고...",
  "괜히 땀 나게 운동이나 하고...",
  "다 귀찮다... 잠이나 자자...",
  `\n[ 1과 2중 아무 키나 누르세요 ]`,
];

export const goSchoolTexts = [
  "< 등교 중... >",
  "조금만 더 걸으면 벌써 학교네...",
  "친구, 사귈 수 있을까?",
  "에이 무슨 배부른 소리를...",
  "무사히 집에나 올 수 있게 해다오!",
  `\n[ 1과 2중 아무 키나 누르세요 ]`,
];

export const goHomeTexts = [
  "< 하교 중... >",
  "정신 차려보니 집에 가고있잖아!!",
  "학교가 지루하지 않을 수 있다니~",
  "발걸음이 가볍다~!",
  "오늘 저녁은 좀 보람차게 보내볼까?",
  `\n[ 1. 계속 ] [ 2. 로비로 ]`,
];

export const lunchTexts = [
  [
    "< 점심 시간!! >",
    '"오~ 우리 너무 자주 보는 거 같지 않아?"',
    '"급식은 맛있게 먹었구?"',
    '"오늘 반찬 네가 좋아하는 거 많던데!!"',
    '"맞아, 이거 젤리 하나 먹을래?"',
    `\n[1. "그...그래! 마침 입가심하고 싶더라!" ]`,
    `[2. "방금 밥 먹었는데 무슨 젤리야..." ]`,
  ],
  [
    "< 점심 시간!! >",
    "( 유빈은 양손에 텅 빈 식판을 들고있다... )",
    "( 급식비를 두 배로 내나...? )",
    '"여~ 오늘 급식 양이 좀 적지 않아~?"',
    '"나는 매점 가는 길인데, 같이 안 갈 텨?"',
    `\n[1. "오호, 오늘의 매점 픽은 무엇인가요?" ]`,
    `[2. "너는 왜 살이 안 찌냐..." ]`,
  ],
  [
    "< 점심 시간!! >",
    '"뭐야! 진짜 나 쫓아다니냐고~"',
    "( 어째선지 기분이 좋아보인다... )",
    '"그나저나, 그 덥수룩한 머리 좀 어떻게 할 수 없어?"',
    '"최소한 앞은 잘 보여야할 거 아니냐고!!"',
    `\n[1. "난 이게 편한데... 나름 괜찮지 않아?" ]`,
    `[2. "학칙은 잘 지켰는데, 무슨 문제라도..." ]`,
  ],
  [
    "< 점심 시간!! >",
    "( 세원은 무표정으로 날 쳐다볼 뿐이다. )",
    "( 내가 뭐라도 말을 해야하나...? )",
    '"할 말 없으면 비켜."',
    "( 이대론 안 된다...!! )",
    `\n[1. "그 저기 혹시 이 게임 말야..." ]`,
    `[2. "어...어... 미안..." ]`,
  ],
  [
    "< 점심 시간!! >",
    "( 규민도 날 만난 게 당황스러운 모양이다. )",
    '"저...저기..."',
    "( 뭔가 할 말이 있는 걸까? )",
    "( 말을 이어가 보자. )",
    `\n[1. "규민이 맞지? 나 네 짝꿍!" ]`,
    `[2. "그... 어차피 같은 자린데 같이 돌아갈까?" ]`,
  ],
];

export const successTexts = [
  "< 고백 성공!! >",
  "이게 꿈이야 생시야!",
  "고백을 받아줄 거라곤 상상도 못 했어!",
  "뭔가 자신감이 차오르는데...?",
  "흐흐흐... 이게 학교 생활이지!!",
  `\n[ 1과 2중 아무 키나 누르세요 ]`,
];

export const failTexts = [
  "< 고백 실패... >",
  "당연한 일인데 감히 기대를 했네...",
  "아무 의욕도 생기지 않는다...",
  "학교 같은 거 다녀서 뭐하나...",
  "역시 난 혼자가 맞아...",
  `\n[ 1과 2중 아무 키나 누르세요 ]`,
];

export const gameOverTexts = [
  "< 게임 오버 >",
  "괜히 우쭐해져서 나섰나봐...",
  "역시 다른 사람과 어울리는 건 쉽지 않다...",
  "학교 같은 거 다녀서 뭐하나...",
  "이번 생은 포기하자...",
  `\n[ 1과 2중 아무 키나 누르세요 ]`,
];

export const gameEndingTexts = [
  "< 히든 엔딩 - 게임광 >",
  "어어......",
  "맨날 게임만 한 게 이렇게 된다고?!",
  "하하하 역시 노력은 배신하지 않는구만!!",
  "오늘도 게임하다 자야지 ^_^",
  `\n[ 1과 2중 아무 키나 누르세요 ]`,
];

export const normalEndingTexts = [
  "< 게임 클리어 >",
  "개학 첫 주가 순식간에 지나가버렸어!",
  "친구가 다섯 명이나 생기다니,",
  "아직도 믿기지가 않네!",
  "올해 학교 생활은 뭔가 즐거울 것 같다~",
  `\n[ 1과 2중 아무 키나 누르세요 ]`,
];

export const dateEventTexts = [
  "< 토요일 아침 >",
  "오늘은 여자친구와 첫 데이트 날!",
  "너무 설레서 잠도 못 잤어~",
  "먼저 나가서 기다리고 있어야지!!",
  "오늘만 기다렸다고!",
  `\n[ 1과 2중 아무 키나 누르세요 ]`,
];

export const needSelectTexts = [
  "< 히든엔딩 - 인기쟁이 >",
  "그러고보니 나 고백을 여러 번...",
  "그치만 난 모두에게 진심이었다고!!",
  "어...어쩌지? 그래도 규범상 한 명만...",
  "내가 마음을 확실히 해야해!",
  `\n[ 1과 2중 아무 키나 누르세요 ]`,
];

export const selectTexts = [
  "< 최종 선택!! >",
  "1. 소꿉친구 김지우",
  "2. 옆반먹보 박유빈",
  "3. 선도부원 송가을",
  "4. 까칠반장 이세원",
  "5. 소심짝꿍 이규민",
  `\n[ 원하는 사람을 선택하세요 ]`,
];

export const selectEndingTexts = [
  "< 히든엔딩 - 인기쟁이 >",
  "그렇게 소중한 여자친구가 생겼다!",
  "인기가 많은 것도 오히려 곤란하네~",
  "비록 어렵게 사귄 친구들을 잃었지만,",
  "난 원래 우정보다 사랑이야 ^_^",
  `\n[ 1과 2중 아무 키나 누르세요 ]`,
];

/* 장면별 대사들 */
export const endMyRoomLine = ["오늘은 이만하면 됐다!", "이제 내일을 위해 자볼까?\n"];

export const moodZeroLine = ["하루 종일 게임도 못 하고 이게 뭐람...", "기분이 안 좋아졌다...\n"];

export const gameEndingLine = ["이렇게 게임만 해도 괜찮은 걸까?", "그래도 요 며칠 실력이 엄청 는 것 같다!\n"];

export const lunchEventLine = ["점심을 먹고 돌아오는 길에 또 마주쳐버렸다!!", "도망치기엔 늦었다... 어... 어쩌지???\n"];

export const endClassroomLine = ["와! 내가 친구가 생겼다니!!", "올해는 꽤 즐겁게 보내게 될지도~!\n"];

export const successLine = ["나... 나 여자친구가 생겼어!!", "꿈인가??? 진짜라고????\n"];

export const failLine = ["너... 너무 성급했나....", "학교 더 이상 다니고 싶지 않아...\n"];

export const confiZeroLine = ["역시 나 같은 걸 좋아해줄 리가 없지...", "학교 더 이상 다니고 싶지 않아...\n"];

export const lowClosenessLine = ["친구 만드는 게 이렇게 어려운 일일까...", "학교 더 이상 다니고 싶지 않아...\n"];

export const greetTexts = [
  '"오~ 올해는 같은 반이네! 잘 지내보자?"',
  '"안녕, 이거 맛있어."',
  '"아침부터 만나다니!! 따라다니지 좀 마!!"',
  '"뭐야, 용건 없으면 비켜줄래?"',
  '"................으음..."',
];

export const confiUpLines = [
  '"역시 그럴 줄 알았다고~ 자, 여기!"\n[ 자신감이 20 올랐다! ]',
  '"궁금하면 어서 따라오라구~"\n[ 자신감이 20 올랐다! ]',
  '"너...너!! 설마 네가 잘생겼다고 생각한다거나...!!"\n[ 자신감이 20 올랐다! ]',
  '"여...여기서 그런 얘길 하면 어떡해!! 따...따라와!"\n[ 자신감이 20 올랐다! ]',
  '"으...응! 맞아, 이규민!"\n[ 자신감이 20 올랐다! ]',
];

export const confiDownLines = [
  '"젤리 배는 따로 있다고...!"\n[ 자신감을 20 잃었다! ]',
  '"그런 실례되는 질문은 삼가도록 해~"\n[ 자신감을 20 잃었다! ]',
  '"그거 때문에 그러는 게 아니잖아 멍청아!!"\n[ 자신감을 20 잃었다! ]',
  "( 날 한심하게 쳐다보곤 지나간다...)\n[ 자신감을 20 잃었다! ]",
  '"아..아냐... 난 괜찮아..."\n[ 자신감을 20 잃었다! ]',
];

export const talkGoodReation = [
  '"아하하 정말~? 재밌다! 이따 또 이야기해줘?"',
  '"오 그렇구나. 이건 조금 이따 먹어야겠구먼."',
  '"그... 그런 거 하나도 궁금하지 않거든?"',
  '"너도 그 게임 알...!! 아, 아니 그런 거 너나 해!"',
  '"오... 응 맞아... 고마워."',
];

export const talkBadReation = [
  '"요즘도 그런 거 하는구나...! 그래 재밌게 해!!"',
  "( 무관심하게 먹던 간식을 먹는다. )",
  '"네가 그럼 그렇지~ 한심하다구~?"',
  '"관심 없으니까 좀 비켜줄래?"',
  '"...미안, 잘 모르겠어..."',
];

export const jokeGoodReation = [
  '"뭐야~ 못 본 새 재치가 늘었는데??"',
  '"오, 이번엔 내 차례. 이거 먹어봐."',
  '"이... 이런다고 내가 즐거워할 거라 생각해?!"',
  '"..."',
  '"와...! 너 굉장하구나..."',
];

export const jokeBadReation = [
  '"아... 응... 담부터 이런 건 하지말아줘..."',
  '"다시는 먹을 걸로 장난 치지마."',
  '"재밌으라고 한 거야? 역시 허접하네~"',
  "( 경멸스러운 무언갈 본 표정이다... )",
  "( 당혹스러운 표정으로 날 쳐다본다... )",
];

export const confessGoodReation = [
  '(쿡쿡 찌르며) "내 어디가 그렇게 좋았어~?"',
  '"오, 그럼 이거 나눠먹자."',
  '"이 내가 만나주는 거니까 감사하라고!!"',
  '"그... 주말에 게임 같이 해..."',
  "( 얼굴이 토마토처럼 붉어진 규민이다... )",
];

export const confessBadReation = [
  '"미안... 그냥 그대로 친구로 지내면 좋겠어."',
  '"나 먹을 것도 부족한데 무슨 소리야? 싫어."',
  '"꺄하하하, 내가 너랑?"',
  "( 인간 이하의 무언가를 보는 듯한 표정이다... )",
  "( 그렇게 다시는 규민이와 대화할 수 없었다... )",
];

export const escapeGoodReation = [
  '"뭐야~ 어차피 집 갈 때 볼 텐데!!"',
  '"에, 쟤도 하나 줄 걸 그랬나"',
  '"꺄하하~ 도망가는 폼도 허접하네~"',
  "( 뒤통수에서 한심해하는 눈빛이 느껴진다... )",
  '"......어.....응.....?"',
];

export const escapeBadReation = [
  '"갑자기 왜 그러는 건데!!!"',
  '"너무 나만 먹었나..."',
  '"너... 너!! 후회할 걸?!"',
  "( 뒤통수에서 서운해하는 눈빛이 느껴진다... )",
  '"....어...어디 가는데....?"',
];

export const gameEndingLines = [
  '"와~ 그렇게 게임만 하더니 결국 유명해졌구나!"',
  '"오, 게임 천재 왔는감? 이거 먹어"',
  '"그...그게 그렇게 재밌어? 어디 나도 알려줘봐"',
  '"나도 그 게임하는데... 같이 해주지 않을래?"',
  '"...대단해...나도 알려줄 수 있을까?"',
];

export const dateEndingTexts = [
  '"어라, 얘는 누구야? 오늘 나랑 데이트하기로 했잖아~"',
  '"에, 입이 늘었네... 둘이 먹기도 모자라~"',
  '"뭐...뭐냐고!! 기껏 차려입고 나왔더니!!"',
  '"뭐야, 기대했는데... 돌아가볼게."',
  "( 금방이라도 울 듯한 표정으로 날 쳐다본다... )",
];

export const selectReactTexts = [
  '"역시 우리가 본 세월이 얼만데~ 앞으로도 잘 지내보자?"',
  '"나로 정했어~? 그럼 어서 맛있는 거 먹으러 가자~"',
  '"당연히 나지, 무슨 고민을 하냐고! 바보!!"',
  '"나...도 게임 많이 좋아해... 같이 해줄 거지...?"',
  '"거..걱정했잖아... 손부터 잡아줘..."',
];
