/* 이벤트씬 */
export const openingTexts = [
  "<오프닝 이벤트>",
  "오프닝 출력 테스트1",
  "오프닝 출력 테스트2",
  "오프닝 출력 테스트3",
  "오프닝 출력 테스트4",
  `\n[1. 계속] [2. 로비로]`,
];

export const goSchoolTexts = [
  "<등교 이벤트>",
  "등교 출력 테스트1",
  "등교 출력 테스트2",
  "등교 출력 테스트3",
  "등교 출력 테스트4",
  `\n[1과 2중 아무 키나 누르세요.]`,
];

export const goHomeTexts = [
  "<하교 이벤트>",
  "하교 출력 테스트1",
  "하교 출력 테스트2",
  "하교 출력 테스트3",
  "하교 출력 테스트4",
  `\n[1. 계속] [2. 로비로]`,
];

export const moodZeroTexts = [
  "<기분 저하 이벤트>",
  "기분 저하 출력 테스트1",
  "기분 저하 출력 테스트2",
  "기분 저하 출력 테스트3",
  "기분 저하 출력 테스트4",
  `\n[1과 2중 아무 키나 누르세요.]`,
];

export const reactionTexts = [
  "<선택지 반응 이벤트>",
  "선택지 반응 출력 테스트1",
  "선택지 반응 출력 테스트2",
  "선택지 반응 출력 테스트3",
  "선택지 반응 출력 테스트4",
  `\n[1과 2중 아무 키나 누르세요.]`,
];

export const lunchEventTexts = [
  "<점심 시간 이벤트>",
  "점심 시간 출력 테스트1",
  "점심 시간 출력 테스트2",
  "점심 시간 출력 테스트3",
  "점심 시간 출력 테스트4",
  `\n[1. 좋은 선택지] [2. 나쁜 선택지]`,
];

export const successTexts = [
  "<고백 성공 이벤트>",
  "고백 성공 출력 테스트1",
  "고백 성공 출력 테스트2",
  "고백 성공 출력 테스트3",
  "고백 성공 출력 테스트4",
  `\n[1과 2중 아무 키나 누르세요.]`,
];

export const failTexts = [
  "<고백 실패 이벤트>",
  "고백 실패 출력 테스트1",
  "고백 실패 출력 테스트2",
  "고백 실패 출력 테스트3",
  "고백 실패 출력 테스트4",
  `\n[1과 2중 아무 키나 누르세요.]`,
];

export const gameOverTexts = [
  "<게임오버 이벤트>",
  "게임오버 출력 테스트1",
  "게임오버 출력 테스트2",
  "게임오버 출력 테스트3",
  "게임오버 출력 테스트4",
  `\n[1과 2중 아무 키나 누르세요.]`,
];

export const gameEventTexts = [
  "<게임광 엔딩 이벤트>",
  "게임광 엔딩 출력 테스트1",
  "게임광 엔딩 출력 테스트2",
  "게임광 엔딩 출력 테스트3",
  "게임광 엔딩 출력 테스트4",
  `\n[1과 2중 아무 키나 누르세요.]`,
];

export const gameEndingTexts = [
  "게임광 엔딩 출력 테스트-지우",
  "게임광 엔딩 출력 테스트-유빈",
  "게임광 엔딩 출력 테스트-가을",
  "게임광 엔딩 출력 테스트-세원",
  "게임광 엔딩 출력 테스트-규민",
];

export const normalEventTexts = [
  "<노말엔딩 이벤트>",
  "노말엔딩 출력 테스트1",
  "노말엔딩 출력 테스트2",
  "노말엔딩 출력 테스트3",
  "노말엔딩 출력 테스트4",
  `\n[1과 2중 아무 키나 누르세요.]`,
];

export const dateEventTexts = [
  "<인기쟁이 엔딩 이벤트>",
  "인기쟁이 엔딩 출력 테스트1",
  "인기쟁이 엔딩 출력 테스트2",
  "인기쟁이 엔딩 출력 테스트3",
  "인기쟁이 엔딩 출력 테스트4",
  `\n[1과 2중 아무 키나 누르세요.]`,
];

export const dateEndingTexts = [
  "인기쟁이 엔딩 출력 테스트-지우",
  "인기쟁이 엔딩 출력 테스트-유빈",
  "인기쟁이 엔딩 출력 테스트-가을",
  "인기쟁이 엔딩 출력 테스트-세원",
  "인기쟁이 엔딩 출력 테스트-규민",
];

export const selectTexts = [
  "<최종 선택 이벤트>",
  "1. 소꿉친구 김지우",
  "2. 옆반먹보 박유빈",
  "3. 선도부원 송가을",
  "4. 까칠반장 이세원",
  "5. 소심짝꿍 이규민",
  `\n[원하는 사람을 선택하세요.]`,
];

export const selectReactTexts = [
  "최종선택 반응 출력 테스트-지우",
  "최종선택 반응 출력 테스트-유빈",
  "최종선택 반응 출력 테스트-가을",
  "최종선택 반응 출력 테스트-세원",
  "최종선택 반응 출력 테스트-규민",
];

export const selectEndingTexts = [
  "<최종선택 엔딩 이벤트>",
  "최종선택 엔딩 출력 테스트1",
  "최종선택 엔딩 출력 테스트2",
  "최종선택 엔딩 출력 테스트3",
  "최종선택 엔딩 출력 테스트4",
  `\n[1과 2중 아무 키나 누르세요.]`,
];